// HTML : 하이퍼 텍스트 마크업 랭기지

// 마크업 : <마크업> 텍스트 </마크업>

// 마크업 속성 : <마크업 속성명 = "속성값"> </마크업>

// 마크업 종류
// 00. <html>                       : HTML 전체
// 00. <head>                       : HTML 문서설정, <title> 문서제목
// 00. <body>                       : HTML 본문
// 01. <h1> ~ <h6>                  : 제목
// 02. <p>                          : 문단
// 03. <br />                       : 줄바꿈
// 04. <hr />                       : 가로선
// 05. <span>                       : 인라인 구역
// 06. <div>                        : 블럭 구역
// 07. <ol> , <ul>                  : 목록
// 08. <li>                         : <ol> , <ul> 마크업 안에 항목
// 09. <a href="링크주소/파일경로">    : 하이퍼링크 
// 10. <img src="파일경로" />          : 이미지
// 11. <audio src="파일경로">          : 오디오
// 12. <video src="파일경로">          : 비디오
// * controls 속성                      : 컨트롤러 제공
// * autoplay 속성                      : 자동실행 (브라우저 정책으로 차단됨)
// * muted 속성                         : 음소거 제공
// 13. <iframe>                     : 외부 컨텐츠를 포함 (퍼가기)

// 14. <form> : 입력 마크업 감싸는 용도, 나중에는 백엔드와 통신 가능
// 15. <input> : 









